Examinator/src/InformationRegisters/БиблиотекаПользователейМеткиРесурсовСУО/БиблиотекаПользователейМеткиРесурсовСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БиблиотекаПользователейМеткиРесурсовСУО</name>
  <attributes>
    <name>Метка</name>
    <type>
      <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ресурс</name>
    <type>
      <types>CatalogRef.ЛитератураСУО</types>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
      <types>CatalogRef.ЗаданияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Фрагмент</name>
    <type>
      <types>CatalogRef.СодержаниеКнигиСУО</types>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/БиблиотекаПользователейСУО/БиблиотекаПользователейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БиблиотекаПользователейСУО</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Метка</name>
    <type>
      <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Библиотека</name>
    <type>
      <types>CatalogRef.КаталогМероприятийСУО</types>
      <types>CatalogRef.СхемыМероприятийСУО</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ресурс</name>
    <type>
      <types>CatalogRef.ЛитератураСУО</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
      <types>CatalogRef.ЗаданияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Фрагмент</name>
    <type>
      <types>CatalogRef.СодержаниеКнигиСУО</types>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Catalogs/СтруктураБиблиотекиПользователейСУО/СтруктураБиблиотекиПользователейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктураБиблиотекиПользователейСУО</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Пользователи</owners>
  <owners>Catalog.КаталогМероприятийСУО</owners>
  <owners>Catalog.СхемыМероприятийСУО</owners>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Скрыть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Видимость</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/ЛитератураСУО/ЛитератураСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЛитератураСУО</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>УДК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ББК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ISBN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расходное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВебСсылка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>АвторыКниги</name>
    <attributes>
      <name>ФИО</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КлючевыеСлова</name>
    <attributes>
      <name>КлючевоеСлово</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/CommonForms/МояБиблиотекаСУО/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Устанавливаем реквизиты
	//
	
	Если ЗначениеЗаполнено(Параметры.Пользователь) Тогда
		Пользователь = Параметры.Пользователь;
	Иначе
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	// Заполняем таблицу "Библиотеки"
	//
	
	ОбновитьБиблиотеки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновленаПерсональнаяБиблиотека" Тогда
		ОбновитьБиблиотеки();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыМетки

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Метки

&НаКлиенте
Процедура МеткиПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанныеМетки = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанныеМетки = Неопределено Тогда
		ТекущаяМетка = Неопределено;
	Иначе
		ТекущаяМетка = ТекущиеДанныеМетки.Ссылка;
	КонецЕсли;

	ВыбраннаяМетка = ТекущаяМетка; // Реквизит формы
	
	ОбновитьРесурсы(ВыбраннаяБиблиотека, ТекущаяМетка);

КонецПроцедуры

&НаКлиенте
Процедура МеткиПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Значение = ПараметрыПеретаскивания.Значение;
	
	Если ТипЗнч(Значение) = Тип("Массив")
		И Значение.Количество() > 0
		И ТипЗнч(Значение[0]) = Тип("ДанныеФормыЭлементКоллекции")
		И Значение[0].Свойство("Ресурс")
		И ЗначениеЗаполнено(Значение[0].Ресурс) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если ВыбраннаяБиблиотека <> Пользователь Тогда
			ПоказатьПредупреждение(,НСтр("ru = 'Перемещать элементы можно только в свою библиотеку.'"));
			Возврат;
		КонецЕсли;
		
		МассивРесурсов = Новый Массив();
		
		Для каждого ЭлементКоллекции Из Значение Цикл
			МассивРесурсов.Добавить(Новый Структура("Ресурс, Фрагмент", ЭлементКоллекции.Ресурс, ЭлементКоллекции.Фрагмент));	
		КонецЦикла;
		
		ЗаписатьМеткуДляНесколькихРесурсов(МассивРесурсов, Метки.НайтиПоИдентификатору(Строка).Ссылка);	
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыБиблиотеки

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Библиотеки

&НаКлиенте
Процедура БиблиотекиПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанныеБиблиотеки = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанныеБиблиотеки = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ТекущиеДанныеБиблиотеки.Ссылка) Тогда
		ТекущаяБиблиотека = Пользователь;
	Иначе
		ТекущаяБиблиотека = ТекущиеДанныеБиблиотеки.Ссылка;
	КонецЕсли;
	
	ВыбраннаяБиблиотека = ТекущаяБиблиотека; // Реквизит формы
	
	ОбновитьМетки(ТекущаяБиблиотека);
	
КонецПроцедуры

&НаКлиенте
Процедура БиблиотекиПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Значение = ПараметрыПеретаскивания.Значение;
	
	Если ТипЗнч(Значение) = Тип("Массив")
		И Значение.Количество() > 0
		И ТипЗнч(Значение[0]) = Тип("ДанныеФормыЭлементКоллекции")
		И Значение[0].Свойство("Ресурс")
		И ЗначениеЗаполнено(Значение[0].Ресурс) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ТекущаяБиблиотека = Библиотеки.НайтиПоИдентификатору(Строка).Ссылка;
		
		Если ТекущаяБиблиотека <> Пользователь Тогда
			ПоказатьПредупреждение(,НСтр("ru = 'Перемещать элементы можно только в свою библиотеку.'"));
			Возврат;
		КонецЕсли;
		
		МассивРесурсов = Новый Массив();
		
		Для каждого ЭлементКоллекции Из Значение Цикл
			МассивРесурсов.Добавить(Новый Структура("Ресурс, Фрагмент", ЭлементКоллекции.Ресурс, ЭлементКоллекции.Фрагмент));	
		КонецЦикла;
		
		ЗаписатьМеткуДляНесколькихРесурсов(МассивРесурсов, ПредопределенноеЗначение("Справочник.СтруктураБиблиотекиПользователейСУО.ПустаяСсылка"));	
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРесурсы

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Ресурсы

&НаКлиенте
Процедура РесурсыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.Ресурс) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда
		
		ОбъектыСУЗКлиент.ОткрытьОбозреватель(ТекущиеДанные.Ресурс,
											 ТекущиеДанные.Фрагмент,
											 ?(ЗначениеЗаполнено(ТекущиеДанные.Фрагмент), Истина, Ложь),
											 ТекущиеДанные.Фрагмент);
		
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.Ресурс) = Тип("СправочникСсылка.ЛитератураСУО") Тогда
		
		ПараметрыФормы = Новый Структура("Книга, ВыделенныйФрагмент", ТекущиеДанные.Ресурс, ТекущиеДанные.Фрагмент);
		ОткрытьФорму("Справочник.ЛитератураСУО.Форма.ФормаКарточка", ПараметрыФормы);
		
	КонецЕсли;

	Если ТипЗнч(ТекущиеДанные.Ресурс) = Тип("СправочникСсылка.ЗаданияСУО") Тогда
		
		ОбучениеСУОКлиент.ОткрытьЗадание(Новый Структура("Задание, НаОсновеЭлектронногоРесурса", ТекущиеДанные.Ресурс, Ложь),, Ложь, Истина);
		
	КонецЕсли;

	Если ТипЗнч(ТекущиеДанные.Ресурс) = Тип("СправочникСсылка.Файлы") Тогда
			
		ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляОткрытия(ТекущиеДанные.Ресурс,, УникальныйИдентификатор);
		РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла);
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Общее

&НаКлиенте
Процедура ОбновитьБиблиотеку(Команда)
	ОбновитьБиблиотеки();
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПерсональнуюБиблиотеку(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("НастроитьПерсональнуюБиблиотекуПродолжение", ЭтотОбъект);		
		
	ОткрытьФорму("Справочник.СтруктураБиблиотекиПользователейСУО.ФормаСписка", Новый Структура("Библиотека", Пользователь),,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПерсональнуюБиблиотекуПродолжение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	ОбновитьБиблиотеки();
КонецПроцедуры	

// Управление метками ресурсов

&НаКлиенте
Процедура УдалитьМеткуРесурса(Команда)
	
	ТекущиеДанные = Элементы.Ресурсы.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ЗаписатьМетку(ТекущиеДанные.Ресурс, ТекущиеДанные.Фрагмент);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьМеткуРесурса(Команда)
	
	Значение = Неопределено;
	Тип = Тип("СправочникСсылка.СтруктураБиблиотекиПользователейСУО");
	Подсказка = НСтр("ru = 'Выберите метку'");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьМеткуРесурсаПродолжение", ЭтотОбъект);		
	ПоказатьВводЗначения(ОписаниеОповещения, Значение, Подсказка, Тип); 	

КонецПроцедуры

&НаКлиенте
Процедура УстановитьМеткуРесурсаПродолжение(Значение, ДополнительныеПараметры) Экспорт
	
	ТекущиеДанные = Элементы.Ресурсы.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(Значение)
		И ТекущиеДанные <> Неопределено Тогда
	
		ЗаписатьМетку(ТекущиеДанные.Ресурс, ТекущиеДанные.Фрагмент, Значение);
		
	КонецЕсли;
	
	
КонецПроцедуры	

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ЗаписатьМетку(Знач Ресурс, Знач Фрагмент, Знач Метка=Неопределено, ОбновитьБиблиотеку=Истина)
	
	Если Фрагмент = Неопределено ИЛИ Фрагмент = NULL Тогда
		
		Если ТипЗнч(Ресурс) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда
			Фрагмент = Справочники.СодержаниеСУЗ.ПустаяСсылка();
		КонецЕсли;
		
		Если ТипЗнч(Ресурс) = Тип("СправочникСсылка.ЛитератураСУО") Тогда
			Фрагмент = Справочники.СодержаниеКнигиСУО.ПустаяСсылка();
		КонецЕсли;
		
		Если ТипЗнч(Ресурс) = Тип("СправочникСсылка.ЗаданияСУО") Тогда
			Фрагмент = Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.БиблиотекаПользователейМеткиРесурсовСУО.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Отбор.Ресурс.Установить(Ресурс);
	НаборЗаписей.Отбор.Фрагмент.Установить(Фрагмент);
	
	Если Метка <> Неопределено Тогда
		
		НоваяЗапись = НаборЗаписей.Добавить();
		
		НоваяЗапись.Пользователь = Пользователь;
		НоваяЗапись.Ресурс       = Ресурс;
		НоваяЗапись.Фрагмент     = Фрагмент;
		НоваяЗапись.Метка        = Метка;
		
	КонецЕсли;
		
	НаборЗаписей.Записать();
	
	Если ОбновитьБиблиотеку Тогда
		ОбновитьРесурсы();	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьМеткуДляНесколькихРесурсов(Знач Массив, Знач Метка)

	Для каждого Элемент Из Массив Цикл
		ЗаписатьМетку(Элемент.Ресурс, Элемент.Фрагмент, Метка, Ложь);
	КонецЦикла;
	
	// Примечание: вероятность, что массив будет содержать
	// Большое количество значений мала, поэтому
	// Оптимизация не требуется.
	
	ОбновитьРесурсы();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьРесурсы(Знач ТекущаяБиблиотека=Неопределено, Знач ТекущаяМетка=Неопределено)
	
	УстановитьПривилегированныйРежим(Истина);

	
	Если ТекущаяБиблиотека = Неопределено Тогда
		ТекущаяБиблиотека = ВыбраннаяБиблиотека;
	КонецЕсли;
	
	Если ТекущаяМетка = Неопределено Тогда
		ТекущаяМетка = ВыбраннаяМетка;
	КонецЕсли;
	
	Ресурсы.Очистить();
	
	Если ТекущаяБиблиотека = Пользователь Тогда
		
		// Выбираем все ресурсы, которым пользователь установил метку

		ТаблицаПользовательскихМеток = РегистрыСведений.БиблиотекаПользователейМеткиРесурсовСУО.ТаблицаПользовательскихМеток(Пользователь);
		
	КонецЕсли;
	
	// Выбираем все пользовательские ресурсы

	ВыборкаДетальныеЗаписи = РегистрыСведений.БиблиотекаПользователейСУО.ВыборкаЭлементовБиблиотекиПользователя(Пользователь);

	// Заполняем таблицу ресурсов
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
		Если РегистрыСведений.БиблиотекаПользователейСУО.РесурсДляДобавления(ВыборкаДетальныеЗаписи, ТаблицаПользовательскихМеток, ТекущаяБиблиотека, ТекущаяМетка, Пользователь) Тогда
			
			НоваяСтрока = Ресурсы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);	
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьБиблиотеки()
	
	Библиотеки.Очистить();
	
	// Определеяем, доступна ли библиотека пользователя
	
	ДоступнаМояБиблиотека = РегистрыСведений.БиблиотекаПользователейСУО.ДоступнаБиблиотекаПользователя(Пользователь);
	
	// Выбираем всех владельцев меток
	
	ВыборкаДетальныеЗаписи = РегистрыСведений.БиблиотекаПользователейСУО.ВыборкаБиблиотекПользователя(Пользователь);
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ВладелецМетки)
			ИЛИ ВыборкаДетальныеЗаписи.ВладелецМетки = Пользователь Тогда
			
			ДоступнаМояБиблиотека = Истина;
			
			Продолжить;
			
		КонецЕсли;
		
		НоваяСтрока = Библиотеки.Добавить();
		
		// Ссылка
		
		НоваяСтрока.Ссылка = ВыборкаДетальныеЗаписи.ВладелецМетки;
		
		// Имя
		
		Если ТипЗнч(НоваяСтрока.Ссылка) = Тип("СправочникСсылка.СхемыМероприятийСУО") Тогда 
			НоваяСтрока.Имя = НСтр("ru = 'Общая библиотека'");
		Иначе
			НоваяСтрока.Имя = ВыборкаДетальныеЗаписи.Наименование;	
		КонецЕсли;
		
		// Картинка
		
		Если ТипЗнч(НоваяСтрока.Ссылка) = Тип("СправочникСсылка.Пользователи") Тогда
			НоваяСтрока.Картинка = 3;
		КонецЕсли;
		
		Если ТипЗнч(НоваяСтрока.Ссылка) = Тип("СправочникСсылка.КаталогМероприятийСУО") Тогда
			НоваяСтрока.Картинка = 2;
		КонецЕсли;
		
		Если ТипЗнч(НоваяСтрока.Ссылка) = Тип("СправочникСсылка.СхемыМероприятийСУО") Тогда
			НоваяСтрока.Картинка = 1;
		КонецЕсли;
		
		// Порядок
		
		Если ТипЗнч(НоваяСтрока.Ссылка) = Тип("СправочникСсылка.Пользователи") Тогда
			НоваяСтрока.Порядок = 3;
		КонецЕсли;
		
		Если ТипЗнч(НоваяСтрока.Ссылка) = Тип("СправочникСсылка.КаталогМероприятийСУО") Тогда
			НоваяСтрока.Порядок = 2;
		КонецЕсли;
		
		Если ТипЗнч(НоваяСтрока.Ссылка) = Тип("СправочникСсылка.СхемыМероприятийСУО") Тогда
			НоваяСтрока.Порядок = 1;
		КонецЕсли;
		
	КонецЦикла;
	
    Если ДоступнаМояБиблиотека Тогда
		
		НоваяСтрока = Библиотеки.Добавить();
		
		НоваяСтрока.Ссылка = Пользователь; 
		НоваяСтрока.Имя = НСтр("ru = 'Моя библиотека'");
		НоваяСтрока.Картинка = 0;
		НоваяСтрока.Порядок = 0;
		
	КонецЕсли;
		
	Библиотеки.Сортировать("Порядок");
	
	Если Библиотеки.Количество() = 0 Тогда
		ВыбраннаяБиблиотека	= Пользователь;
	КонецЕсли;
	
	Если Библиотеки.Количество() = 1 Тогда
		ВыбраннаяБиблиотека	= Библиотеки.Получить(0).Ссылка;
	КонецЕсли;
	
	// Устанавливаем видимость элементов
	
	Если Библиотеки.Количество() < 2 Тогда
		Элементы.Библиотеки.Видимость = Ложь;
	Иначе
		Элементы.Библиотеки.Видимость = Истина;
	КонецЕсли;
	
	// Формируем метки
	
	Если ЗначениеЗаполнено(ВыбраннаяБиблиотека) Тогда
		ОбновитьМетки(ВыбраннаяБиблиотека);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьМетки(Знач ТекущаяБиблиотека=Неопределено)
	
	Если ТекущаяБиблиотека = Неопределено Тогда
		ТекущаяБиблиотека = ВыбраннаяБиблиотека;	
	КонецЕсли;
	
	// Очищаем дерево меток
	
	Метки.ПолучитьЭлементы().Очистить();
	
	ДеревоМеток = РеквизитФормыВЗначение("Метки");
	
	Справочники.СтруктураБиблиотекиПользователейСУО.ЗаполнитьДеревоМеток(ДеревоМеток, ТекущаяБиблиотека, Пользователь); 
	
	Если ДеревоМеток.Строки.Количество() > 0 Тогда
		
		ЗначениеВРеквизитФормы(ДеревоМеток, "Метки"); 
		
		Элементы.Метки.Видимость = Истина;
		
	Иначе
		
		ВыбраннаяМетка = Справочники.СтруктураБиблиотекиПользователейСУО.ПустаяСсылка();
		
		ОбновитьРесурсы(ВыбраннаяБиблиотека, ВыбраннаяМетка);	
		
		Элементы.Метки.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
